abandon
abash
abate
abbreviate
abhor
abhorrence
abiding
ability
ability
abject
abjuration
abjure
able
ably
abnegation
abnormal
abominable
abominably
abounding
abridge
abrogate
abrupt
absolute
absolutely
absorb
abstemious
abstinence
abstract
abstraction
abstruse
absurd
absurdity
absurdity
absurdly
abundance
abundant
abundantly
abuse
abusive
abysmally
abyss
academic
accelerate
acceleration
accent
accents
accentual
accentuat
acceptable
acceptance
accept
accessible
accessory
accident
accidental
acclaim
acclamation
accommodate
accomplish
accomplishments
accredit
accumulate
accumulat
accuracy
accurate
accurs
accusation
accusing
accustom
achievement
achievements
aching
acknowledg
acknowledgment
acoustical
acquaintance
acquiescence
acquire
acquir
acquisition
acrid
acrimonious
acrimony
act
action
active
actively
activity
activity
acts
actual
actualization
actualiz
acumen
acute
acutely
acuteness
adamantine
adaptation
adaptive
addition
additions
address
adduc
adequacy
adequate
adherence
adherent
adherents
adhesion
adhesive
adjuncts
adjust
administer
admirable
admiration
admire
admissible
admission
admittedly
admonitory
adolescent
adorable
adoration
adorn
adroit
adroitness
adulat
advance
advances
advantage
advantageous
advantages
adventitious
adventure
adventurer
adventurous
adverse
advice
advisable
affability
affable
affably
affectation
affectations
affect
affection
affectionate
affective
affianc
affirmation
affirmations
affirmative
affluence
affluent
affright
affright
affront
afraid
after-thoughts
age
agency
agent
ages
aggrandizement
aggravat
aggregate
aggression
aggressive
aggressiveness
aghast
agile
agility
agitate
agitat
agitation
agonize
agony
agreeable
agreement
aids
aim
aimless
aims
air
airs
airy
alacrity
alarm
alarm
alarming
alert
algebraic
alien
alive
all
all-pervade
alleg
allegiance
allegorical
alliance
alli
alliteration
alliterative
allowable
allowance
allurement
allurements
alluring
allusion
allusions
alone
aloofness
alterations
alternate
altogether
altruistic
amass
amatory
amaze
amaz
amazement
amazing
ambidextrous
ambiguity
ambiguous
ambition
ambitions
ambitious
ambling
ambrosial
amenity
amiable
amicable
amity
amorous
ample
amplification
amplifi
amplitude
amus
amusement
amuse
analogous
analytical
anarchy
ancestors
ancestral
anchorage
ancient
and
anecdote
angelic
angels
anger
angry
anguish
anguish
angular
animate
animat
animating
animation
animosity
animosity
annihilateerroneous
annoyance
annoyances
annoying
annul
anomaly
anomalous
anon
anonymous
answer
answering
antagonism
antagonist
antagonistic
antagonists
antecedent
anticipat
anticipations
anticipative
antipathy
antipathy
antiquat
antiquity
antithesis
anxiety
anxiety
anxious
apathetic
apathy
aphoristic
apish
apocalyptic
apocryphal
apologetic
apology
apostrophic
apothegmmedley
appall
appalling
apparel
apparent
apparition
apparitions
appeal
appealing
appearance
appearances
appellation
appellations
appetites
applaud
applause
appoint
apposite
appraisement
appreciable
appreciation
appreciative
apprehend
apprehension
apprehensive
apprentice
approach
approbation
appropriate
approval
approve
approve
approximately
apt
aptitude
aptly
arbitrarily
arbitrary
arch
arch
archeological
architectural
archness
ardent
ardor
arduous
argue
argument
arguments
arid
aristocracy
aristocratic
aromatic
arrange
arrang
arrangement
arrant
arrest
arrogance
arrogant
arrogate
arson
art
artful
artifice
artifices
artificial
artistic
artistry
artless
artlessness
ascendency
ascending
ascetic
ascrib
asham
aspect
aspects
asperity
aspersions
aspiration
aspirations
aspire
assemble
assembl
assent
assert
assertion
assiduity
assiduityaugust
assiduitydisagreement
assiduously
assimilat
assimilation
assimilative
assistance
assistant
associat
association
associations
assuag
assum
assumption
assumptions
assurance
assurances
assur
assuredly
astonish
astonishing
astonishment
astound
astounding
astute
asunder
athletic
atmospheric
atoms
atonement
atone
atrocious
atrocity
atrophi
attach
attachment
attack
attacks
attainments
attempt
attending
attention
attentive
attenuat
attest
attitude
attitudes
attract
attractive
attractiveness
attribute
attributes
audacious
audacity
audacity
audible
augment
augment
augmenting
augury
august
auspicious
austere
austerity
authentic
authenticity
authoritative
authority
autobiographical
autocracy
autocratic
automatic
autumnal
auxiliary
auxiliary
available
avarice
avaricious
avenge
average
aversion
avert
avidity
avow
awake
awaken
awakening
awe
aw
awful
awkward
awkwardness
axiomatic
axioms
azure
babble
babbler
babble
babel
bacchanalian
bachelor
backbone
backgrounds
bad
badinage
baffl
balanc
baldly
baleful
balmy
banality
bandying
baneful
banish
bankrupt
barbarism
barbarity
barbarous
bards
bare
barefac
barest
bargain
barren
barrier
barriers
barrister
base
baseless
bashful
basic
basis
batter
battle
beam
beaming
bearing
bearish
beatific
beating
beauty
beautiful
beautify
beauty
beckoning
become
bedraggl
befitting
befogg
beg
beggar
beggarly
beginning
begrim
beguile
behavior
belat
belaud
belief
beliefs
belittling
bellicose
bellowing
benediction
benefactor
beneficent
beneficial
benefit
benevolence
benevolent
benight
benign
benignant
benignity
bent
benumb
bereavement
beseeching
beset
besetting
besott
bestial
bestowing
bewilder
bewildering
bewilderment
bewitch
bewitching
beyond
bibulous
big-sounding
bigot
bigotry
bigots
billing
billows
binding
biography
birth
bite
bits
bitter
bitterness
bizarre
black
blackening
blackness
blameless
blanch
bland
blandishment
blandishments
blandness
blank
blare
blasphemous
blatant
blaze
blazing
blazon
bleak
blend
blend
blending
bless
blessing
blight
blind
blindly
blinking
blissful
blistering
blithe
bloat
blockheads
bloodless
bloodsh
bloodthirsty
blot
blows
blue
blunder
blundering
blunt
blurr
blush
bluster
blustering
boast
boastful
boasting
bodily
body
boisterous
bold
boldness
bombast
bombastic
bondage
bone
bookish
boon
boorish
bor
boredom
borrow
bottomless
boundless
bountiful
bourgeois
boyish
brace
brag
braggadocio
braggart
brain
bravado
brave
bravely
bravery
braying
brazen
breadth
breathless
breeding
breeze
brevity
bribery
brief
briefless
bright
brightness
brilliancy
brilliant
brisk
briskness
bristling
brittle
broad
broad-gag
broaden
broadening
broken
brooding
brooks
brotherhood
brow
brusqueness
brutal
brutality
brutish
bubbling
bucolic
budding
bulk
bulks
bulky
bulli
bully
bulwark
bumptious
bungling
buoyant
burden
burdens
burdensome
buri
burly
burning
bursting
busily
business
businesslike
bustle
bustling
busy
busybody
butchery
bygone
byways
cabalistic
cadaverous
cadence
cajol
calamitous
calamity
calculat
calculating
calculations
callous
callousness
callow
calm
calmness
calumnious
calumny
candid
candor
cant
cantankerous
canting
capable
capacious
capacity
capacity
caprice
capricefashion
capricious
capriciousness
captious
captivate
captivating
cardinal
care
career
careful
careless
carelessness
cares
caressing
careworn
carping
caste
castellat
casual
casuists
cataclysmic
cause
causelessly
causes
caustic
caution
cautious
cavernous
caviling
ceaseless
celebrat
celerity
celestial
censor
censorious
censure
censur
censures
centraliz
century
ceremony
ceremonious
ceremony
certain
certainty
cerulean
cessations
chafe
chagrin
challenge
chance
change
changes
changing
channel
chant
chaos
chaotic
character
characteristic
characteristics
characterize
charges
charitable
charity
charlatan
charm
charming
chary
chasm
chaste
chasten
chastening
chatter
chattering
chatty
cheap
check
cheek
cheeks
cheer
cheerful
cheerfulness
cheering
cheery
chequer
cherish
cherish
chief
childhood
childish
childlike
chill
chill
chimerical
chirpy
chivalrous
chivalry
choicest
choleric
choral
chorus
chronic
chronicler
churlish
churlishness
circling
circuitous
circulation
circumlocution
circumscribe
circumscrib
circumstance
circumstances
citation
civic
civility
civilization
civiliz
civilizing
claim
clammy
clamor
clamorous
clang
clangorous
claptrap
clarion
clarity
class
classical
classifi
classify
clatter
clattering
clean
clear
clear-head
clearness
clever
cleverness
climactic
climax
clinching
cloak
clogg
cloister
close
cloudless
clouds
cloudy
clownish
clownishly
cloy
cloying
clumsy
clustering
coarse
coarseness
coax
coax
coaxing
coercion
coercive
coexistent
cogent
cogitate
coherence
coherent
cohesion
coincidence
coin
cold
coldness
collateral
collect
collective
colloquial
colonial
color
colorless
colossal
comatose
combative
combination
combin
comely
comfort
comfort-loving
comfortable
comforting
comforts
comic
command
commanding
commend
commendable
comment
comments
commerce
commercial
commercialism
commingl
commodiously
commodity
common
commonness
commonplace
commonplaces
commotion
communicative
communicativeness
compact
companion
comparative
compare
comparison
compass
compassion
compassionate
compel
compelling
compendious
compensatory
competent
competitive
complacency
complacent
complaining
complaints
complaisance
complaisant
complement
complete
completely
completeness
complex
complexity
compliance
compliant
complicat
complications
compliment
complimentary
component
compos
composite
composition
composure
compound
comprehensible
comprehension
comprehensive
compress
compression
compromises
compromising
compulsory
compunctious
concatenat
conceal
conceal
concealment
conceit
conceit
conceivable
conceiv
concentrate
concentrat
conception
concern
concern
concert
concession
concessions
conciliating
conciliatory
concise
conclusion
conclusions
conclusive
concomitant
concomitants
concord
concrete
concurrent
condemnable
condemnation
condemn
condensation
condescending
condescension
condition
conditional
conditions
condolence
condon
conduct
confess
confessedly
confession
confidence
confident
confidently
confiding
confirm
confirm
conflict
conflicting
conform
conformations
conforming
confound
confuse
confus
confusing
confusion
congratulations
congruous
conjectural
conjecture
conjugal
connect
connection
connotative
connubial
conquer
conquer
conquering
conquest
consanguinity
conscience
conscientious
conscious
consciously
consciousness
consecrat
consent
consequence
consequent
conservative
considerate
consideration
consider
consistency
consistent
consolation
consol
consoling
conspicuous
conspirator
conspir
constancy
constant
constellations
constituent
constitution
constitutional
constrain
constraint
construction
constructive
consuming
consummate
consummat
consummation
contagious
contaminating
contemn
contemnnice
contemplate
contemplation
contemplations
contemplative
contemporary
contempt
contemptible
contemptuous
content
content
contention
contentment
contingency
contingent
continu
continuity
continuous
contort
contortions
contract
contracting
contradiction
contradictions
contradictory
contrary
contrast
contrast
contravene
contrivance
contrive
contriv
contriving
control
controll
controlling
controversial
controversy
controversy
contumelious
conveniences
convenient
conventional
conventionality
conversation
conversational
convert
conviction
convince
convincing
convivial
convulsion
convulsions
convulsive
cooing
cool
coolly
coolness
copious
copiousness
coquetry
coquette
coquettish
cordial
corners
corollary
corporate
corporeal
correct
correct
correction
correlative
corresponding
corroborat
corroboration
corroding
corrosive
corrupt
corrupting
corruption
cosmical
cosmopolitan
costly
counselor
counsels
countenance
counterbalancing
countless
country
courage
courageous
course
coursing
court
courteous
courtesy
courtly
covert
covet
covetousness
cowardice
cowardly
cowards
cowering
coxcomb
coy
coyness
crabbedness
crackling
craft
crafty
craggy
cramp
cranks
crash
crass
craven
craving
crawling
crazy
creation
creative
creature
credible
credibly
creditable
credulity
credulous
cre
creeds
creeping
cry
crime
crimes
criminal
cringing
crippl
crises
crisisneglect
crisp
critic
critical
criticism
criticisms
criticize
crouching
crowd
crown
crowning
crucial
crucifying
crude
crudity
cruel
cruelty
crumbling
crunching
crusader
crush
crushing
cryptic
crystal
crystalline
crystalliz
cudgeling
culinary
culminating
culpable
culprit
cultivat
cultivation
culture
cultur
cumbersome
cumbrous
cumulative
cunning
cunningly
cup
cupidity
curb
curb
curiosity
curious
current
curry
curs
curses
cursory
curt
curtain
curv
curves
custom
customs
cutting
cycloramic
cymbal
cynical
cynicism
daintiness
dainty
damage
damaging
damask
dampen
dampness
dancing
danger
dangerous
dangers
dappl
daring
dark
darkness
darling
dart
dash
dashing
dastardly
data
dates
dauntless
dawn
dawning
daybeams
days
daz
dazzle
dazzl
dazzlement
dazzling
dead
deadly
deaf
death
deathless
debase
debas
debasing
debatable
debat
debilitating
decadent
decay
deceit
deceitful
deceiving
decency
decent
deception
decide
decid
decisions
decisive
declamation
declamatory
declar
decline
decorate
decorat
decorations
decorous
decorously
decorousness
decorum
decree
decrepit
decry
deductions
deep
deep-seat
deep-ton
deepening
deface
defame
defeat
defeat
defeats
defective
defender
defense
defenseless
defensive
deference
deferential
defiance
defiant
deficient
define
definite
deform
deformity
deformity
deft
deft-finger
deftness
degradation
degrade
degrad
degrading
deject
dejection
delays
delectable
delegat
deleterious
deliberate
deliberately
delicacy
delicate
delicious
delight
delight
delightful
delights
delineate
delinquency
delirious
delivery
delusion
delusions
delusive
demagogic
demagogues
demands
demarcations
demeanor
democracy
democratic
demolish
demoniacal
demonstrable
demonstrative
demonstrativeunhappy
demoraliz
demoralizing
demure
denial
denials
denizens
denounc
dense
denunciation
denunciations
denunciatory
deny
depart
dependable
dependence
dependent
depict
deplorable
deportment
deprav
depravity
deprecatory
depreciation
depress
depressing
depression
deprivation
deprive
depth
depthless
depths
derelict
derision
derisive
derogatory
describe
describ
description
descriptive
desecrat
desecrater
desecration
desert
desert
desertion
deserv
deserving
desideratum
design
designat
designation
design
designing
designs
desirable
desire
desires
desolate
desolat
desolating
desolation
despair
despairing
despatch
desperate
desperation
despicable
despise
despis
despoil
despoil
despondency
despondent
despotic
despotism
destiny
destitute
destitution
destroy
destroy
destruction
destructive
desuetude
desultory
desultoryheal
detach
detail
details
detect
deteriorating
deterioration
determinate
determination
determine
determin
detestable
dethron
detonations
detraction
detrimental
devastate
devastating
develop
develop
development
deviating
deviation
devices
devilish
devious
deviously
devitaliz
devot
devotion
devotions
devouring
devout
devoutness
dewdrop
dewy
dexterity
dexterous
diabolical
dialectic
dialogue
diametrically
diapason
dictatorial
diction
dictionary
didactic
diet
difference
differences
different
differentiating
difficult
difficulty
difficulty
diffidence
diffident
diffuse
diffuseness
digest
digestion
dignifi
dignify
dignity
digression
digressional
digressive
dilatory
dilemma
dilettante
diligence
diligent
diligently
dim
dimensions
diminish
diminutive
dimness
din
dingy
diplomacy
diplomatic
dire
direct
direct
directing
direction
directness
directorate
direful
dirty
disagreeable
disagreement
disappear
disappoint
disappoint
disappointing
disapprobation
disapproval
disapprovals
disarm
disaster
disasters
disastrous
discard
discerning
discernment
disciples
discipline
disciplin
disclos
disclosure
discomfit
discomfiture
discomfort
disconcert
disconnect
disconsolate
discontent
discontent
discord
discordant
discords
discourage
discourag
discouraging
discourse
discourses
discourtesy
discover
discovery
discovery
discredit
discreet
discrepancy
discretion
discretional
discriminating
discrimination
discursive
discuss
discuss
discussion
disdain
disdainful
disease
diseas
disembodi
disenchant
disengag
disfigur
disfiguring
disgrace
disgraceful
disgruntl
disguise
disguis
disgust
disgust
disgusting
dishearten
disheartening
dishevel
dishonest
dishonesty
dishonor
dishonorable
dishonor
disillusion
disinclination
disingenuous
disingenuousness
disintegrating
disintegration
disinterest
disinterestedness
disjoin
disjoint
dislike
dislikes
dislocation
disloyal
disloyalty
dismal
dismantl
dismay
dismay
dismiss
disorder
disorderly
disorganizing
disparaging
disparity
dispassionate
dispatch
dispell
dispelling
dispirit
dispirit
display
displeasing
disposition
dispossess
disproportionate
disputant
disputative
dispute
disputes
disquiet
disquieting
disquietude
disregard
disrelish
disreputable
disrespect
dissatisfi
dissembler
disseminat
dissension
dissent
dissenting
dissertation
dissertations
dissimilar
dissipate
dissipat
dissolute
dissolve
dissolving
dissonance
dissonant
dissuade
distance
distant
distaste
distasteful
distastes
distemper
distend
distinct
distinction
distinctive
distinguish
distinguishing
distort
distort
distortion
distract
distracting
distraction
distractions
distraught
distress
distress
distressing
distrust
disturb
disuse
diurnal
divergence
divergent
diverging
diverse
diversification
diversifi
diversion
diversions
diversity
diverting
divest
divine
divines
division
dizzy
docile
doctrine
doctrines
document
documentary
doddering
dogg
doggedness
doggerel
dogma
dogmas
dogmatic
dogmatism
doleful
dolorous
domain
domestic
dominant
dominate
dominating
domination
domineering
dominion
doom
dormant
dose
doubly
doubt
doubtful
downright
downtrodden
drab
draggl
drama
dramatic
drastic
dread
dreadful
dream
dreamer
dreaming
dreamless
dreams
dreamy
dreariness
dreary
dregs
dribble
drift
drill
drill
driveling
droll
drollery
drone
droning
drooping
drowsy
drudge
drudgery
drunkenness
dry
dubious
ductile
ductility
dulcet
dull
dullards
dull
dullslim
dulness
dumb
dumbfound
dupe
duplicity
durable
duration
dusk
dusky
dust
dusty
duty
dutiful
dutious
duty
duty-loving
dwarf
dwindle
dynamic
dynastic
eager
eagerness
ear
early
earnest
earnestly
earnestness
earth
earthly
ease
easy
ebb
eccentric
eccentricity
eccentricity
ecclesiastical
echoes
echoless
eclectic
economic
economy
ecstasy
ecstasy
ecstatically
eddyings
edification
edifice
edifying
education
educational
effect
effective
effectiveness
effects
effectual
effeminacy
effeminate
effervescence
effervescent
effete
efficacious
efficacy
efficiency
efficient
efflorescent
effluent
effluvium
effort
effulgent
effusion
effusions
effusive
egoistic
egotism
egotistic
egregious
ejaculatory
elaborate
elaboration
elastic
elasticity
elation
electric
elegance
elegant
element
elemental
elementary
elements
elephantine
elevate
elevat
elfish
eligibility
elongat
eloquence
eloquent
elucidation
elusive
emaciat
emanations
emancipating
emasculat
embarrass
embarrass
embarrassing
embarrassment
embellish
embellish
embellishment
embellishments
embitter
emblazon
embodiment
embolden
embrace
embrasure
embryo
emerald
emerg
emergency
eminence
eminent
emolumentprofuse
emoluments
emotion
emotional
emotions
emotive
emphasis
emphasize
emphatic
empirical
employment
emptiness
empty
emulative
enactment
enamor
enchant
enchanting
enchantment
encircling
encouragement
end
endearing
endearment
endeavor
endless
endowment
endurance
enduring
enemy
energetic
energy
energy
enervating
enfeebl
enfeebling
enfold
enforc
engaging
engender
engross
engrossing
engulf
engulfing
enhance
enhanc
enigma
enigmatical
enjoyment
enlarge
enlighten
enlighten
enlightenment
enliven
enlivening
enmity
enmity
ennoble
ennobl
ennobling
enormity
enormous
enormously
enrage
enraptur
enrich
enrich
enshrin
enslave
enslav
entangl
enterprise
enterprising
entertaining
enthralling
enthronement
enthusiasm
enthusiasms
enthusiast
enthusiastic
enticing
entire
entrancing
entreat
entreaty
enveloping
envenom
enviable
envy
envious
environing
environment
envy
enwrap
ephemeral
epicurean
epigram
epigrammatic
episodes
epithet
epitomize
epoch
equable
equal
equality
equally
equanimity
equipment
equipoise
equitable
equitably
equity
equivalent
equivocal
equivocation
equivocations
era
eradicate
erect
erotic
errant
erratic
erring
erroneous
error
errors
erudite
eruptive
escapades
escutcheon
esoteric
especial
especially
espous
essence
essential
essentially
establish
esteem
esthetic
estimable
estimate
estrangement
eternal
ethereal
ethical
eulogy
euphuistic
evade
evanescent
evangelic
evasion
evasive
eventful
events
eventual
ever
everlasting
everyday
evidence
evident
evil
eviscerating
exact
exacting
exactions
exactitude
exactness
exaggerate
exaggerat
exaggeration
exalt
exaltation
exalt
examination
examine
example
examples
exasperate
exasperating
exasperations
exce
exceedingly
excellence
excellent
exception
exceptional
exceptions
excessive
excitable
excitement
excitements
exclamations
exclude
exclusive
exclusiveness
excrescence
excretory
excruciating
excursive
excusable
execrable
execration
execut
execution
executive
exegesis
exemplar
exemplary
exercise
exertion
exhaust
exhaustion
exhaustive
exhaustless
exhibition
exhilaratechiefly
exhilarat
exhilarating
exhortation
exigency
exigency
exile
existence
exordium
exoteric
exotic
expansive
expectant
expectation
expectations
expediency
expedient
expeditionary
expeditious
expeditiously
expend
expenditure
expensive
experience
experienc
experiences
experiment
experimental
expert
expertness
expiatory
explain
explain
explanation
explicit
explorations
explore
explosive
exposition
exposure
express
expression
expressionless
expressions
expressive
exquisite
extemporaneous
extend
extend
extension
extent
extenuating
exterior
exterminate
external
extinction
extirpate
extol
extortion
extraneous
extraordinary
extravagance
extravagant
extreme
extremely
exuberance
exuberant
exuberantly
exultant
exultations
eye
eyes
fables
fabricate
fabricat
fabrication
fabulous
face
facetious
facile
facility
factitious
factor
facts
faculty
faculty
fad
fads
fagg
failure
failures
faint
faintly
fair
fairy
faith
faithful
faithfully
faithfulness
fallacious
fallacy
fallibility
false
falsehood
falsehoods
falsification
faltering
fame
familiar
familiarity
familiarity
famine
famish
famous
fanatic
fanatical
fanaticism
fancy
fanciful
fancy
fantastic
fantasy
far-reaching
far-sightedness
farce
farcical
fascinate
fascinating
fascination
fashion
fashion
fashions
fastidious
fastidiousness
fat
fatal
fatalistic
fate
fathomless
fatigue
fatigu
fatiguing
fattening
fatuity
fatuous
faultless
faults
faulty
favor
favorable
favors
fawning
fear
fearful
fearless
fearlessness
fears
feasible
feature
features
fecundity
feeble
feebleness
feeling
feelings
feign
felicitous
felicity
feminine
ferocious
ferocity
fertile
fertility
fervent
fervently
fervid
fervor
festive
fet
fetid
fetish
fetter
feverish
feverishly
fiber
fibs
fickle
fickleness
fiction
fictitious
fidelity
fidgety
fierce
fiery
figurative
figure
figures
filaments
filial
final
finality
fine
fineness
finical
finish
finish
fire
fires
fireside
firm
firmness
first
fitful
fitness
fitting
fixity
fizzing
flaccid
flagging
flagitious
flagrant
flamboyant
flame
flaming
flare
flash
flashing
flat
flatness
flatter
flatter
flatterer
flattery
flattering
flattery
flaunting
flawless
fleecy
fleeting
flexible
flicker
flickering
flight
flights
flighty
flimsiness
flimsy
flippancy
flippant
flit
floating
florescence
florid
flotsam
flourish
flow
flower
flowery
flowing
fluctuating
fluency
fluent
fluffy
fluid
flush
fluttering
focus
focus
foe
foggy
fogs
foibles
foil
foliage
folly
folly
fond
foolhardy
foolish
foolishness
fools
footing
footsteps
fop
forbearance
forbearing
forbidding
force
forceful
forcefulness
forcible
forebodings
forecast
foregone
foreland
foremost
forensic
forerunner
foresight
forest
forfeit
forfeiture
forgiveness
forgotten
forlorn
forlornness
form
formal
formality
formality
formidable
formless
formlessness
forms
formula
formulat
fortifi
fortitude
fortress
fortuitous
fortunate
fortune
forward
foster
foster
foul
foundation
fragile
fragmentary
fragments
fragrance
fragrant
frail
frailty
frank
frankly
frankness
frantic
fraternal
frauds
fraudulent
freakish
free
freeborn
freedom
freely
freezing
frenzi
frenzy
frequent
fresh
freshening
freshness
fretful
fretfulness
friend
friendless
friendliness
friendly
friendship
frighten
frightful
frigid
frippery
frisky
frivolity
frivolity
frivolous
frolicsome
froth
frozen
fructifying
frugal
fruitage
fruitful
fruitless
frustrate
frustrat
fuddl
fugitive
full
fullness
fully
fulsome
fumble
fumbling
fuming
fun
function
functional
functions
fundamental
funereal
furious
furiously
furrow
furthering
furtive
fury
fussing
fussy
fustian
futile
futility
gabbling
gaiety
gait
gallant
gallantry
galling
gallop
galvanic
gambols
gaping
garb
garbl
garbling
garden
garish
garner
garnish
garrulity
garrulous
gasp
gather
gathering
gaudy
gaunt
gay
gaze
genealogy
general
generality
generalization
generations
generative
generic
generosity
generous
genial
genius
genteel
gentility
gentle
gentlemanly
genuine
genuineness
geological
geometrical
germ
germinal
germinate
gesticulation
gesticulations
gesture
gestures
ghastliness
ghastly
ghostly
ghosts
giant
gibberish
gibe
gibes
giddy
gift
gift
gifts
gigantic
gird
girlhood
girlish
gladdening
gladiatorial
gladness
gladsome
glamour
glance
glances
glare
glaring
glassy
gleam
gleaming
glean
gleeful
glib
glibly
gliding
glimmer
glimmering
glistening
glitter
glittering
gloom
gloomy
glory
glorious
glory
gloss
glow
glowering
glowing
glum
glut
gnawing
godlike
golden
good
good-humor
good-will
goodness
goodwill
gorge
gorgeous
gorgeousness
gossip
gossiping
gossipy
govern
govern
governing
government
grab
grace
graceful
gracefulness
graces
gracious
graciously
gradations
gradual
graduat
graft
grand
grandeur
grandiose
graphic
grasp
grasping
gratification
gratitude
gratuitous
grave
graveyard
graveyards
gravity
gray
grayness
great
greatness
gre
greedy
greeting
gregarious
grief
grievance
grievously
grim
grimace
grimaces
grinding
grinning
griping
grizzl
grope
gross
grossness
grotesque
ground
groundless
group
groveling
growing
growth
grudging
gruff
grumbling
guarantees
guard
guesses
guidance
guide
guileless
gulf
gullible
gurgling
gush
gushing
gusto
gusty
guttural
gymnastic
habit
habits
habitual
habitually
hackney
haggard
hairbreadth
halcyon
hale
hallow
hallucinations
halting
hamper
hand
handicap
handicraft
handsome
handsomely
haphazard
happiness
happy
harangues
harass
harassing
hard
hard-working
harden
harden
hardihood
hardship
hardships
harmful
harmless
harmonious
harmonize
harmony
harrowing
harsh
harvest
haste
hasty
hate
hateful
hatr
haughtiness
haughty
haunting
hauteur
hazard
hazardous
hazy
head
headlong
headstrong
health
healthful
healthy
heart
heart-sick
heartfelt
hearth
heartiness
heartless
heartrending
hearty
heat
heat
heathen
heavenly
heaviness
heavy
hecklings
hectic
hectoring
heedless
heedlessness
height
heighten
heinous
helpful
helpfulness
helpless
helplessness
herculean
hereditary
heresy
heretical
heretics
heritage
hermetically
heroic
heroism
hesitating
hesitation
heterogeneous
hidden
hideous
high
high-flying
high-mind
high-spirit
highly
highly-strung
hilarious
hilarity
hills
hillside
hint
hints
hissing
historic
history
hither
hoard
hoarse
hoarseness
hoary
hobby
hodge-podge
hollow
hollowness
holy
homage
homebr
homeless
homeliness
homely
homespun
homicidal
homogeneous
honest
honestly
honesty
honey
honor
honorable
honor
honors
hooligan
hoot
hope
hopeful
hopefulness
hopeless
hopelessly
hopelessness
hopes
horde
hordes
horizon
horrible
horrid
horror
hortatory
hospitable
hospitality
host
hostile
hostility
hosts
hot
hovering
howling
hubbub
huddl
huge
hum
human
humane
humanitarian
humanity
humble
humbly
humbug
humdrum
humid
humiliating
humiliation
humility
humor
humorless
humorous
humors
hungry
hurry
hurrying
hurtful
hush
husks
husky
hybrid
hypnotic
hypochondriacal
hypocrisy
hypocrisy
hypocrite
hypocrites
hypocritical
hypotheses
hypothesis
hysteria
hysterical
iciness
iconoclastic
icy
idea
ideal
idealistic
idealists
ideals
ideas
identical
identity
idiomatic
idiosyncrasy
idiotic
idle
idleness
idolatrous
idyllic
ignoble
ignominious
ignominy
ignoramus
ignorance
ignorant
ill-balanc
ill-conceal
ill-temper
illiberal
illimitable
illiterate
illogical
illuminating
illuminations
illuminative
illumine
illumin
illusion
illusions
illusive
illusiveness
illustration
illustrative
illustrious
imagery
images
imagination
imaginative
imbecile
imbecility
imbitter
imbitter
imitat
imitation
imitations
imitators
immaterial
immature
immeasurable
immediate
immemorial
immense
immensity
immethodical
imminent
immitigable
immobility
immoderate
immoral
immortal
immovable
immovably
immunity
immutable
impair
impalpable
impartial
impartiality
impassable
impassion
impatience
impatient
impatientimprovident
impeccable
impecunious
impel
impelling
impending
impenetrable
impenitent
imperative
imperceptible
imperfect
imperfection
imperial
imperil
imperious
imperiousarchitecture
imperishable
impersonal
impertinence
impertinent
imperturbable
impervious
impetuosity
impetuous
impetus
impinging
impious
impish
implacable
implicit
impli
implore
implor
imponderable
importance
important
importunate
importunesorrow
importunity
impos
imposing
imposition
impossibility
impossible
impostor
imposture
impotent
impoverish
impracticable
imprecations
impregnable
impressible
impression
impressionistic
impressions
impressive
impressiveness
imprisoning
improbable
impromptu
impropriety
impropriety
improvement
improvising
imprudent
impudence
impudent
impulse
impulses
impulsive
inaccessible
inaccurate
inactive
inactivity
inadequate
inadmissible
inadvertency
inadvertent
inalienable
inane
inanimate
inapplicable
inapposite
inaptly
inarticulate
inaugural
inborn
inbr
incalculable
incarnate
incautious
incendiary
incense
incens
incentive
incessant
incessantly
inchoate
incident
incidental
incidents
incipient
incisive
incisiveness
inclinations
incoherence
incoherent
incommunicable
incomparable
incompatibility
incompetence
incomplete
incompletely
incomprehensible
inconceivable
inconclusive
inconclusiveness
incongruity
incongruous
inconsecutive
inconsiderable
inconsiderate
inconsistency
inconsistency
inconsistent
inconsolable
incontestable
incontrovertible
inconveniences
inconvenient
incorrigible
incorruptible
increasing
incredible
incredulity
incredulous
indebtedness
indecent
indecision
indecorously
indecorum
indefatigable
indefeasible
indefinable
indefinite
indelible
indelicate
indent
independence
independent
indescribable
indescribably
indestructible
indeterminable
indications
indifference
indifferent
indigence
indigenous
indignant
indignation
indignity
indirect
indirectly
indiscretion
indiscriminate
indispensable
indisputable
indissoluble
indistinct
individual
individuality
individually
indivisible
indolence
indolent
indomitable
indors
indubitable
indulge
indulg
indulgence
indulgent
industrious
industry
indwelling
ineffable
ineffaceable
ineffective
ineffectual
inefficiency
inefficient
inelastic
inept
ineptitude
inequality
ineradicable
inert
inertness
inestimable
inevitable
inexact
inexcusable
inexhaustible
inexorable
inexpedient
inexpensive
inexperienc
inexplicable
inexpressible
inexpressive
inextricable
infallible
infamous
infamy
infantile
infantine
infatuations
infectious
infelicitous
infelicity
inference
inferences
inferential
inferior
inferiors
infernal
infinite
infinitesimal
infirm
infirmity
inflam
inflat
inflexibilityoffensive
inflexible
influence
influences
influential
inform
informal
information
inform
informing
infuriate
infuriat
ingenious
ingenuity
ingenuous
ingenuousness
inglorious
ingrain
ingratiating
ingratitude
inharmonious
inherent
inherit
inhuman
inhumanity
inimitable
iniquitous
initiatory
injudicious
injunction
injure
injur
injurious
injury
injustice
inky
inmost
innate
inner
innocence
innocent
innocently
innocuous
innovating
innuendo
innuendoes
inoffensive
inopportune
inordinate
inquiry
inquiry
inquisitional
inquisitive
inquisitiveness
insanely
insatiable
inscrutable
insecure
insecurity
insensate
insensibility
insensible
insensibly
inseparably
insidious
insight
insignificant
insincere
insincerity
insinuatingly
insinuations
insipid
insipidity
insistence
insistent
insolence
insolent
insoluble
inspiration
inspiring
inspirit
inspiriting
instability
instance
instances
instant
instantaneous
instigate
instinct
instinctive
instincts
institutions
instruct
instruction
insufferable
insufferably
insufficient
insular
insult
insulting
insuperable
insupportable
insurmountable
intangible
integral
integrity
intellect
intellectual
intelligence
intelligent
intelligible
intemperate
intense
intensifi
intensify
intensity
intensive
intention
intentional
intentions
intentness
interaction
intercourse
interdependence
interdependent
interest
interest
interesting
interests
interference
interior
interlacings
interlocking
interlude
interludes
intermediate
interminable
intermingl
intermittent
internal
interpolat
interpretation
interpretative
interrogation
interruption
interruptions
interwoven
intimacy
intimate
intimately
intimation
intimations
intolerable
intolerably
intolerant
intoxicating
intractable
intrench
intrepid
intricacy
intricate
intrigues
intriguing
intrinsic
intrusive
intuition
intuitive
invaluable
invariable
invasion
invective
invectives
inveighing
invent
invention
inventions
inventive
investigation
inveterate
invidious
invigorate
invigorating
invincible
inviolable
inviolate
invisible
inviting
invocation
involuntary
involut
involve
involv
invulnerable
inward
inwardness
irascible
irate
iridescent
irksome
iron
ironic
ironical
irony
irradiate
irradiating
irrational
irreclaimable
irreconcilable
irrecoverably
irrefragable
irrefutable
irregular
irregularity
irrelevancy
irrelevant
irreligious
irremediable
irreparable
irreplaceable
irrepressible
irreproachable
irresistible
irresolute
irresolution
irresponsible
irresponsibly
irretrievable
irreverence
irreverent
irreversible
irrevocable
irrevocably
irritability
irritable
irritation
isolat
issues
iteration
jabber
jackanapesforce
jad
jagg
jangle
jargon
jarring
jarrings
jaundic
jaunty
jealous
jealousy
jealousy
jeer
jeopardy
jest
jesting
jests
jetsam
jibes
jingling
jocular
jocularity
jocund
jostle
jostl
jostling
jottings
journals
jovial
joviality
joy
joyful
joyous
joys
jubilant
judgment
judgments
judicial
judicious
judiciously
juggl
jumble
jumpings
juncture
jurisdiction
just
justice
justifiable
juvenile
kaleidoscopic
keen
keep
kind
kind-heart
kindle
kindl
kindliness
kindly
kindness
kindnesses
kindr
kingdom
kingly
knavish
knightly
knowable
knowing
knowingness
knowledge
known
labor
labor
laborer
laborious
labors
labyrinth
labyrinthian
lacerat
lachrymose
lack
lackadaisical
laconic
lady
lagging
lake
lambent
lame
lamentable
lamentation
lamentations
language
languid
languor
lapse
lapses
large
large-heart
lashing
lassitude
lasting
latent
latitude
laudable
laugh
laughable
laughter
lavish
lavish
lavishness
law
lawful
lawless
lawlessness
lawn
laws
laxity
laziness
lazy
lead
leaden
leadership
leading
leafage
lean
leaping
learn
learning
lectures
leering
legal
legend
legendary
legends
legislation
legislative
legitimate
legitimately
leisure
leisurely
lengthening
lengthy
lenient
leonine
lethargic
lethargy
letter
levity
libelers
libelous
liberal
liberality
liberating
liberty
license
licentiousness
life
lifeless
lifelong
light
lightless
lightly
lightness
lightning
lights
likely
limitation
limitations
limit
limpid
lineage
lineaments
lingering
linguistic
link
liquid
lisping
lispings
listening
listless
literal
literally
literary
literature
lithe
little
littleness
liveliness
lively
livid
living
loathing
loathsome
local
lodger
loftiest
lofty
logic
logical
loitering
lone
loneliness
lonely
long
longing
longings
look
loom
looming
loose
looseness
loquacious
loquacity
lordly
loss
lost
loud
lounging
loutish
love
loveliness
loving
lovingly
low
lowering
lowest
loyal
loyalty
lucid
lucidity
lucky
lucrative
ludicrous
lugubriou
lugubrious
lukewarm
lull
lumbering
luminous
lure
lurid
lurking
luscious
lust
luster
lustrous
lusty
lute
luxuriance
luxuriant
luxurious
luxury
lying
machinations
maddening
madness
magic
magical
magisterial
magnanimity
magnanimous
magnetic
magnificence
magnificent
magnify
magniloquent
magnitude
maidenly
maim
main
maintain
majestic
majesty
majority
makeshifts
maladjust
malcontent
malevolence
malevolent
malice
malicious
malign
malignant
malignity
malodorous
manageable
mangl
manhood
mania
manifest
manifestation
manifold
manipulat
manly
manner
manners
mantling
manual
manufactur
many
mark
marketable
marriages
marshal
martial
marvelous
marvels
masculine
mask
mass
masses
massive
massiveness
master
masterly
mastery
matchless
material
materialistic
materials
maternal
mathematical
matrimonial
matur
maudlin
mawkish
maxim
maxims
maximum
maze
meager
mean
meaning
meaningless
means
measure
measur
measures
mechanical
mechanism
meddlesome
meddling
mediocrity
mediocrity
meditate
meditative
meditatively
medley
meek
meekness
melancholy
mellifluous
mellow
melodious
melodramatic
melody
melting
memorable
memory
memory
menace
menacing
mendacious
mendacity
mendicant
mental
mention
mercenary
merchantable
merciful
merciless
mercurial
mercy
mere
meretricious
meridian
merit
merit
meritorious
merriment
merry
metallic
metamorphosis
metaphor
metaphors
metaphysical
meteoric
method
methodical
methodically
methods
metrical
microscopic
mien
might
mighty
mild
mildness
militant
military
millennial
mimic
minatory
mince
mincing
mind
mindless
minds
mingl
mingling
miniature
minor
minute
minuteness
miraculous
mire
mirroring
mirth
mirthful
misadventures
misanthrope
misapprehension
mischief
mischievous
misconception
misdemeanor
misdemeanors
miserable
miserly
misery
misfortune
misfortunes
misgiving
misgivings
misinterpret
misleading
mismanagement
misrepresent
misshapen
misspent
mist
mistake
mistaken
mistakes
mistrustful
mists
misty
misunderstandings
mitigating
mixture
moaning
moans
mobb
mobile
mobility
mock
mockery
mode
models
moderate
moderation
modes
modest
modesty
modifi
molding
moldy
mollifying
moment
momentary
momentous
monarch
monarchial
monastic
money
monopoly
monotone
monotonous
monotony
monster
monstrous
monumental
mood
moody
moonlight
moonshine
moony
moral
morality
morals
morbid
mordant
moribund
morose
morsels
mortal
mortification
mortifi
motionless
motive
motives
motley
mountain
mountainous
mountains
mountebankqualifi
mournful
mouthing
mov
movement
movements
mud
muddl
muddling
muddy
muffl
mullion
multifarious
multiform
multiple
multitude
multitudinous
mundane
mural
murder
murderous
murky
murmur
murmuring
murmurs
muscularity
music
musical
musing
musings
mutability
mutable
mute
mutilat
mutinous
mutter
muttering
mutual
myriad
myrmidons
mystery
mysterious
mystery
mystic
mystify
mythical
myths
nagging
naive
nak
nameless
narcotic
narrative
narrow
narrowing
narrowness
nasal
nascent
national
native
natural
nature
nauseous
nautical
neat
neatness
nebulous
necessarily
necessary
necessity
necromancy
necromantic
needless
needs
nefarious
negations
negative
neglect
negligence
negligible
negotiate
neighboring
nerve
nerveless
nervous
nettl
network
neutral
new
nice
nicety
nicety
niggardly
nightmare
nimble
nincompoops
noble
nocturnal
nodding
noise
noiseless
noisy
nomadic
nomenclature
nominal
non-committal
nonchalant
nondescript
nonentity
nonsense
nonsensical
nook
nooks
noonday
normal
notable
not
noteworthy
nothingness
noticeably
notion
notions
notoriety
notoriously
nourish
novel
novelty
novice
noxious
nuclear
nucleus
nugatory
null
nullify
numb
number
numberless
numerical
numerous
oath
oaths
obdurate
obedience
obedient
obeisance
obey
obey
object
objection
objectionable
objectionably
objects
objurgation
obligation
obligatory
obliging
obligingly
oblique
obliquity
oblivion
oblivious
obloquy
obnoxious
obscure
obscur
obscureness
obscurity
obsequy
obsequious
observant
observation
observations
observer
obsolete
obstacles
obstinacy
obstinate
obstinatetendency
obstreperous
obtrusive
obtuse
obvious
occasional
occult
occupation
occupations
occupi
ocean
odd
oddity
oddity
odious
odorous
odors
offendscanty
offense
offensive
official
officious
oily
old
olfactory
olive
omen
ominous
ominously
omnipotent
omniscient
omnivorous
oncoming
one
oneness
onerous
onflaming
onward
opalescent
opaque
open
openly
opinion
opinionat
opinions
opponent
opportunely
opportunism
opportunity
opportunity
opposite
opposition
oppress
oppression
oppressive
oppressor
opprobrious
optimism
optimistic
opulence
opulent
oracular
orator
oratorical
oratory
order
orderly
ordinary
organic
organization
oriental
origin
original
originality
originally
ornate
oscillate
oscillating
oscillation
oscillatory
ostensible
ostentation
ostentatious
ostentatiousness
ostentatioustheory
outbalanc
outburst
outcry
outdo
outlandish
outline
outlines
outpouring
outrageous
outrageously
outspoken
outstanding
outstretching
outward
outworn
overbearing
overburden
overcome
overestimat
overflowing
overhanging
overlook
overmastering
overpower
overpowering
overrat
overriding
overrule
overshadowing
oversight
overstep
overstrain
overt
overvaulting
overweari
overweening
overwhelming
overwork
pacific
pacifi
pacifying
padding
pageantry
pages
pain
painful
pains
painstaking
painting
palatable
pale
pallidly
palpable
palpitating
paltry
pamper
panacea
panegyrics
panic
panorama
panting
parable
parabolic
parade
paradoxical
paralyzing
paramount
parasitical
parch
pardon
parental
parlance
parody
paroxysmal
paroxysms
parrying
parsimonious
parsimoniousaversion
parsimoniousnoble
partial
particular
particularly
party
parting
partizan
passing
passion
passionate
passions
passive
pastime
pastimes
pastoral
patchwork
patent
paternal
path
pathetic
pathos
pathway
patience
patient
patiently
patriarchal
patriotic
patriotism
pattern
paucity
pause
peace
peaceable
peaceableness
peaceful
peacefully
peaks
peccadilloes
peculiar
peculiarity
pecuniary
pedagogue
pedant
pedantic
pedantry
pedantry
pedestrian
pedigree
peerless
peevish
peevishness
pellucid
penalty
pending
penetrating
penetration
penetrativeness
penitential
penn
penniless
pensive
penurious
peppery
peradventure
perceptible
perception
peremptorily
peremptory
peremptorycompassion
perennial
perfect
perfection
perfectly
perfidious
perfidy
performance
perfunctory
peril
perilous
period
permanent
permeate
permission
pernicious
perpetual
perpetuat
perplex
perplex
perplexing
perplexity
perplexity
persecut
persecuting
perseverance
persistency
persistent
persistently
person
personage
personal
personality
perspicacity
perspicuity
perspicuous
perspiring
persuade
persuasion
persuasive
pert
pertinacious
pertinacity
pertinent
perturbation
perturb
perusing
pervading
perverse
perversion
perversity
pervert
pessimist
pessimistic
pestiferous
pestilence
pet
petrifi
pett
petticoat
pettifogging
pettiness
petty
petulance
petulant
phantom
phantoms
pharisaical
phases
philanthropic
philosopher
philosophers
philosophic
philosophical
philosophize
philosophy
phlegmatic
phosphorescent
photographic
phrase
phraseology
phrases
physical
pictorial
picture
pictures
picturesque
picturesqueness
piercing
piety
pilgrim
pilgrimage
pillage
pinchbeck
pinch
pining
pinnacles
pioneering
pious
piquancy
piquant
piteous
pitfalls
pith
pithy
pitiable
pitiful
pitiless
pits
pity
pivotal
placable
place
placid
placidity
plague
plagu
plain
plainly
plainness
plainspoken
plaintive
plaintiveness
plan
plann
plans
plastic
platitude
platitudes
plausibility
plausible
play
playful
playfulness
pleasant
pleasantness
pleasantry
pleas
pleasing
pleasurable
pleasure
pleasures
plenary
plenitude
plentiful
plenty
pliable
pliant
plight
plight
plodding
plot
plots
pluck
plunder
plundering
poem
poetical
poetry
poets
poignant
point
point
pointless
poise
pois
poison
poisonous
polish
polite
politeness
political
politics
polluting
pomp
pomposity
pompous
ponder
ponderous
pontifical
poor
popular
popularity
population
populous
portentous
portraiture
portrayal
pose
position
positive
positively
positiveness
possession
possessions
possibility.unmeaning
posthumous
posture
potency
potent
potential
potentiality
poverty
power
powerful
powerless
powers
practicable
practical
practices
practise
practises
praise
prais
praiseworthy
prankish
prate
prating
prattle
prayer
prayerful
prayers
precarious
precariousness
precaution
precautionary
precedence
precept
precious
precipice
precipitous
precise
precision
precocious
preconceiv
preconceptions
predatory
predecessor
predestin
predilection
predominance
predominant
predominating
preeminence
preeminent
preference
pregnancy
pregnant
prejudice
prejudic
prejudices
prejudicial
preliminary
preliminary
prelude
premature
premonitory
preoccupi
prepossessing
prepossessions
preposterous
prerequisite
prescient
prescrib
presence
present
presiding
pressing
pressure
prestige
presumptuous
pretend
pretense
pretension
pretensions
pretentious
pretentiousness
preternatural
pretext
pretty
prevailing
prevent
pride
priestly
prig
primal
primary
prime
primeval
primitive
primness
primordial
princely
princes
principal
principally
principles
priority
prismatic
pristine
private
privation
privilege
privileg
privileges
priz
probability
probable
probity
problem
problematic
process
processes
procrastinating
procrastinatingsolemn
procrastination
prodigal
prodigality
prodigally
prodigious
productive
productiveness
profane
profanity
professedly
profession
professional
proffer
proficiency
profile
profit
profitable
profitless
profligacy
profligate
profound
profundity
profuse
profusion
programs
progress
progression
progressive
project
project
projects
prolegomenous
proletariat
prolific
prolix
prolong
prominence
promiscuous
promiscuousness
promise
promising
prompt
promptitude
promulgat
proneness
pronounc
pronunciation
proof
propagandist
propagat
propelling
propensity
propensity
proper
property
property
prophecy
prophetic
propitiating
propitiatory
propitious
proportion
proportionate
proportionately
proportions
propose
proprietary
propriety
prosaic
prose
prospective
prospects
prosperity
prosperous
prostrate
prostration
protect
protection
protective
protervity
protest
protestations
protesting
protests
protoplasmic
protract
proud
prove
proverb
proverbial
provident
provincial
provincialism
provisional
provocative
provoke
provok
prowess
prudence
prudent
prudential
prudery
prun
prurient
prying
psychic
public
pucker
puerile
puerilekeen
puffing
puffy
pugnacious
pugnacity
puissant
pulsating
pulsing
punctilio
punctilious
punctiliouspassions
pungencymalice
pungent
punishment
puny
puppy
purblind
pure
purgatorial
purge
purifi
purify
puritanical
purity
purplish
purpose
purpos
purposeful
purposely
purposes
pursue
pursu
pursuing
pursuit
pursuits
pusillanimity
pusillanimous
puzzl
puzzles
pyrotechnic
quack
quackery
quailing
quaint
quaintness
qualifying
quality
quality
quantity
quarrel
quarrels
quarrelsome
quavering
queer
quenchless
query
querulous
quest
question
questionable
questioning
questionings
questions
quibble
quibbles
quibbling
quick
quicken
quickness
quiescent
quiet
quintessential
quips
quirks
quiver
quivering
quixotic
quizzical
quondam
quotations
racial
rack
rack
raconteur
racy
radiance
radiant
radiate
radiating
radical
radicalism
rage
ragg
raging
raise
rambling
ramifications
rampant
rancorous
random
range
rank
rant
ranting
rapacious
rapacity
rapid
rapidity
rapt
rapture
raptures
rapturous
rare
rarefi
rash
rashly
rashness
rational
ravenous
ravishing
raw
reaction
reactionary
reactions
readiness
reading
ready
ready-witt
reaffirm
real
realism
realistic
reality
reality
reanimating
reason
reasonable
reasonably
reason
reasoning
reasons
reassurance
reassuring
rebellion
rebellious
rebuffs
rebuke
rebukes
recent
receptive
receptivity
recesses
reciprocal
reckless
recognition
recogniz
recoil
recollection
recompens
reconciliation
recondite
reconnoiter
reconstruct
reconstructive
recover
recreation
recrimination
rectitude
recumbent
recurrence
recurring
reddening
redeeming
redoubl
redress
redundant
reenforcing
refine
refin
refinement
refinements
refining
reflect
reflection
reflections
reflective
refractory
refreshing
refutation
regal
regard
regret
regretful
regular
regularity
reign
reiterat
reiteration
rejection
rejoinder
relation
relations
relatively
relaxation
relax
relentless
reliable
relief
religion
religious
relinquishment
relish
reluctance
reluctant
remark
remarkable
remedial
reminiscence
reminiscences
remonstrance
remorse
remorseful
remorseless
remote
rend
renown
renown
reparations
repeat
repel
repellent
repelling
repentance
repentant
repetition
repining
reports
repose
reprehensible
repress
repress
reproach
reproaches
reproachful
reprobation
reproof
repudiate
repugnance
repulsion
repulsive
reputation
reput
requirement
requisite
requisites
research
resemblances
resent
resentful
resentment
reservation
reserve
reserv
resignation
resilient
resistless
resolute
resolution
resolv
resonant
resounding
resource
resourceful
respect
respectable
respect
respectful
respite
resplendence
resplendent
response
responsibility
responsibility
responsive
rest
restitutions
restive
restless
restlessness
restorative
restrain
restrain
restraint
restraints
restrict
result
resultant
retaliating
retaliation
retarding
reticence
reticent
retirements
retiring
retreat
retreating
retribution
reveal
revelation
revelry
revenge
revengeful
rever
reverence
reverent
reverential
reverie
revery
reverse
reverses
reviewers
revil
revilings
revis
revival
revolt
revolting
revolution
revolutionary
reward
rhapsodical
rhapsody
rhetorical
rhymes
rhythmic
rhythmical
rich
riches
richly
richness
riddles
ridicule
ridiculous
right
righteous
righteousness
rightful
rights
rigid
rigidity
rigor
rigorous
ring
riotous
ripe
ripeness
ripening
rise
rising
ritual
rivals
rivet
roar
robust
robustness
rococo
rollicking
romance
romantic
root
root
roseate
rotation
rough
roundabout
rous
rousing
royal
rubbish
rubicund
rude
rudeness
rudimentary
rueful
ruffl
rugg
ruin
ruin
rule
rul
rulers
ruling
rumbling
ruminating
rumors
rural
rush
rushing
rust
rustic
rusticity
rustling
ruthless
sacerdotal
sacr
sacredness
sacrifice
sacrifices
sacrilege
sacrilegious
sacrosanct
sad
sadly
sadness
safe
safeguard
safety
sagacious
sagacity
sagacityjust
sage
sages
saintly
salient
sally
salutary
sameness
sanctimonious
sanction
sane
sanguinary
sanguine
sapient
sarcasm
sarcasms
sarcastic
sardonic
satanical
satiategood
satiety
satire
satirical
satirist
satirize
satisfaction
satisfy
satisfying
saturating
saturnalia
saturnine
savage
savagery
saying
sayings
scalding
scandalize
scandaliz
scandalous
scant
